blog/2011/07/29/php-download---solving-chinese-file-name-garbled/index.html
<!DOCTYPE html>
<html lang="en-us">
<head>
  <title>PHP下载：解决中文文件名乱码 - Gu Weigang</title>
  <meta charset="utf-8" />
  <meta name="author" content="Gu Weigang" />
  <meta name="description" content="" />
  <meta name="keywords" content="" />

  <link rel="alternate" title="RSS Feed" href="/rss.xml" type="application/rss+xml">

  <link rel="stylesheet" href="/media/css/main.css" type="text/css">
  <link rel="stylesheet" href="/media/css/prettify.css" type="text/css">
</head>

  <body class="container">
<header id="header">
  <h1 class="title"><a href="/">Gu Weigang</a></h1>
  <ul>
    <li><a href="/blog/">Blog</a></li>
    <li><a href="/tags/">Tags</a></li>
    <li><a href="/about/">About</a></li>
  </ul>
  <form method="get" id="search" action="https://duckduckgo.com">
    <input type="text" class="field" name="q" id="s" placeholder="Search">
    <input type="hidden" name="as_sitesearch" value="guweigang.com">
  </form>
</header>

<section id="content" role="main">
  <h1>PHP下载：解决中文文件名乱码</h1>
  <p>
通过把Content-Type设置为application/octet-stream， 可以把动态生成的内容当作文件来下载，相信这个大家都会。 那么用Content-Disposition设置下载的文件名， 这个也有不少人知道吧。 基本上，下载程序都是这么写的：
</p>


<pre class="example">
    &lt;?php
$filename = "document.txt";
header('Content-Type: application/octet-stream');
header('Content-Disposition: attachment; filename=' . $filename);

print "Hello!";
?&gt;
</pre>


<p>
这样用浏览器打开之后，就可以下载document.txt。
</p>

<p>
但是，如果$filename是UTF-8编码的，有些浏览器就无法正常处理了。 比如把上面那个程序稍稍改一下：
</p>


<pre class="example">
    &lt;?php
$filename = "中文 文件名.txt";
header('Content-Type: application/octet-stream');
header('Content-Disposition: attachment; filename=' . $filename);

print "Hello!";
?&gt;
</pre>


<p>
把程序保存成UTF-8编码再访问，IE6下载的文件名就会乱码。 FF3下下载的文件名就只有“中文”两个字。Opera 9下一切正常。
</p>

<p>
输出的header实际上是这样子：
</p>


<pre class="example">
Content-Disposition: attachment; filename=中文 文件名.txt
</pre>


<p>
其实按照<a href="http://tools.ietf.org/html/rfc2231">RFC2231</a>的定义， 多语言编码的Content-Disposition应该这么定义：
</p>


<pre class="example">
Content-Disposition: attachment; filename*="utf8''%E4%B8%AD%E6%96%87%20%E6%96%87%E4%BB%B6%E5%90%8D.txt"
</pre>


<p>
即：
</p>


<ul class="org-ul">
<li>filename后面的等号之前要加 *
</li>
<li>filename的值用单引号分成三段，分别是字符集(utf8)、语言(空)和urlencode过的文件名。
</li>
<li>最好加上双引号，否则文件名中空格后面的部分在Firefox中显示不出来
</li>
<li>注意urlencode的结果与php的urlencode函数结果不太相同，php的urlencode会把空格替换成+，而这里需要替换成%20
</li>
</ul>


<p>
经过试验，发现几种主流浏览器的支持情况如下：
</p>














<p>
IE6
</p>




<p>
attachment; filename="&lt;URL编码之后的UTF-8文件名&gt;"
</p>










<p>
FF3
</p>




<p>
attachment; filename="UTF-8文件名"
</p>










<p>
attachment; filename*="utf8''&lt;URL编码之后的UTF-8文件名&gt;"
</p>










<p>
O9
</p>




<p>
attachment; filename="UTF-8文件名"
</p>


























<p>
这样看来，程序必须得这样写才能支持所有主流浏览器：
</p>


<pre class="example">
    &lt;?php

$ua = $_SERVER["HTTP_USER_AGENT"];

$filename = "中文 文件名.txt";
$encoded_filename = urlencode($filename);
$encoded_filename = str_replace("+", "%20", $encoded_filename);

header('Content-Type: application/octet-stream');

if (preg_match("/MSIE/", $ua)) {
   header('Content-Disposition: attachment; filename="' . $encoded_filename . '"');
} else if (preg_match("/Firefox/", $ua)) {
  header('Content-Disposition: attachment; filename*="utf8\'\'' . $filename . '"');
} else {
   header('Content-Disposition: attachment; filename="' . $filename . '"');
}

print 'ABC';
?&gt;
</pre>

</section>



<footer id="footer">
    Send comments, critique and suggestions to <a href="mailto:guweigang &lt;at&gt; outlook &lt;dot&gt; com">Gu Weigang</a>.
    Powered by <a href="https://github.com/kelvinh/org-page">org-page</a>
</footer>

  </body>
</html>
